[
  {
    "path": "posts/welcome/",
    "title": "Welcome to BizMakeover 2",
    "description": {},
    "author": [
      {
        "name": "Li Shuxian",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T13:21:06+08:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2021-06-20-the-sharpe-ratio/",
    "title": "Biz Makeover2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Li Shuxian",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation is shown below.\r\n\r\n1.1 Clarity\r\nNo title and legend in the graph Without title of graph, readers cannot extract the main objective of the graph. There is no specific illustration about time frame of the data extracted from the graph.\r\nInconsistent axis header Names of both y-axis and x-axis are inconsistent. For instance, there are two headers in x-axis: “NET EXPORTS” and “Exports”. Reader might be confused which value it is.\r\nUnclear of derived values There is no explanation of calculation of net import and net export.\r\nUnclear source of comment There is short paragraph describe trading in Singapore between China and United States in the bottom of picture. Those information cannot be observed from the graph which lacks evidence.\r\n1.2 Aesthetic\r\nToo many colors in the graph There are ten countries in the graph, each of them has one color but they stand for the same meaning: total number of trading volume in the year. Rainbow colors should be avoided.\r\nRepeating monetary units Every amount in the graph has a monetary unit S$ xx Bil in the graph. It was repeated for ten times.\r\nFull opacity There are areas where countries overlap each other, due to full opacity, it is covered and block reader’s from full picture of the graph.\r\nConfusing position of top net importer and top net exporter sign Sign of top net importer and top net exporter are positioned above countries. The shape of the sign is circle which looks like countries whose sign is also circle. Readers might treat them as countries at a glance.\r\n2.0 Alternative Design\r\nThe proposed design is shown in the following.\r\n ## 2.1 Clarity\r\nInteractive panel allows audience to choose countries select and animations allow readers to see how trading volume changes over time.\r\nBox plot is used to show uncertainty distribution variability over time.\r\nOutliers can show clearly what are months trading falls out of normal range and it can be reflected in responding heat map.\r\n2.2 Aesthetic\r\nAnnotations are used to emphases key observations.\r\nBright and contrastive colors are applied so that readers can focus on their interested category.\r\n3.0 Proposed Visualisation\r\nFor a clearer graph, please click the link on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nOpen raw data using excel.\r\n\r\nRemove first 5 rows in both spreadsheet T1 and T2 to ensure header is in first row.\r\n\r\nRemove row 2 to row 8 in both sheet T1 and T2, since those rows are cumulative values for continents.\r\n\r\nDelete row 115 to 128 in sheet T1 as they are commentary. Similarly, repeat that in T2.\r\n\r\nRemove column B to PE since requested period is between January 2011 to December 2020 in both sheets. Similarly, remove data from January 2021 to April 2021 in both sheets.\r\n\r\nInsert a new column in sheet T1, name it as “Type”, fill the rows with “Import”. Repeat the same procedure in sheet T2 except the name is “Export” instead.\r\n\r\nSet range of table to better insert into tableau.\r\n\r\n\r\nSelect variables and type and unpivot rest of columns.\r\n\r\nRename the 3rd and 4th columns into month and trade value, respectively.\r\n\r\nClose and load the table, a new table 1 will appear, rename the sheet as import.\r\n\r\nMultiply trade value by 1000 to reflect real trading amount.\r\n\r\nRepeat step g to k in export sheet as well. Combine these 2 tables into a new excel workbook. Inner join the table by country name and month of the year.\r\n\r\nRename the variables and change datatype of month from string to date.\r\n\r\ncreate new variables Net Import and Net Export using calculation field.\r\n\r\nCreate upper and lower bond for net export.\r\n\r\nDrag lower and upper bound to measure values.\r\n\r\nPut month in column, sum of net export and measure values in rows. Filter by country and measure names.\r\n\r\nAdd average reference line, change the format and add the customized label.\r\n\r\nCreate new variable Outlier and drag it into color pane.\r\n\r\nEdit title of graph, insert variable country.\r\n\r\nChart: Net Export time series with outliers is completed shown as such. Repeat the same step to create Net Import chart.\r\n\r\nCreate a new sheet, drag month of year to column and year in row to create a heatmap.\r\n\r\nDrag net export to color and measure names to detail.\r\n\r\nApply filter by country. A heat map is created completely.\r\n\r\nTo show uncertainties of net import over time, box plot is created. Drag year to columns, net export as rows.\r\n\r\nCreate 2 new variables, positive/negative net export using if condition and drag them into tooltip.\r\n\r\nAdd filter by country and measure names as well. Drag month of year and measure names into tooltip.\r\n\r\nEdit tooltip where net export with negative value is blue color while positive one is red.\r\n\r\nAdjust size of circle and reduce opacity.\r\n\r\nEdit title of graph, insert variable country.\r\n\r\nBox plot is completed as shown.\r\n\r\nCreate ranking variables using rank_dense for net export and also net import.\r\n\r\nCreate a new sheet, drag country to column and net export to rows.\r\n\r\nApply year, net export and country (to select multiple countries) to filter.\r\n\r\nDrag export trade value, import trade value, net import ranking, net export ranking, net export, positive net export, negative net import, year into detail. Choose net export to color pane.\r\n\r\nClick sort to rank them in descending order.\r\n\r\nEdit tooltip as below.\r\n\r\nThe final main panel is shown.\r\n\r\nOpen a dashboard to drag all these graphs inside, select automatic size.\r\n\r\nSwitch on animation for all sheets.\r\n\r\nShow filter of countries, select worksheet it applies.\r\n\r\nShow filter of year and multiple countries, select single value for first country and period.\r\n\r\n\r\nShow highlight of all field.\r\n\r\nHide time series header for net import.\r\n\r\nThe final dashboard is ready. \r\n5.0 Derived Insights\r\nMainland China: The net export results from January 2011 to December 2018 shows an average performance between $1,221,107,952 and -$38,569,636. There was a sharp decreased in net export in January 2019 which rates about -$1,178,839,000. This sharp fall bounced right back to $1,832,598,000 on the following month, February 2019. Outstanding increase of net export value also shown in August 2019 which performed a highest rate among all the years about $2,077,969,000. \r\nUnited States of America:  Back in January 2011 to January 2020, there is an underperformance net exports shown in the graph which range between -$511,229,502 to -$1,996,866,464. In the year of 2020, U.S net export values increased from -$568.861,000 to $2 billion. This outstanding performance started from January 2020 to July 2020. \r\nThailand:  Starting from January 2011, Thailand has an average performance of their net export values till September 2019. The performance increased to $1.4 billion from September 2019 to March 2020. However, the following month in April 2020, there was a noticeable drop to -$5.6 million.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T16:55:11+08:00",
    "input_file": "the-sharpe-ratio.knit.md"
  }
]
